{"data":{"allHomeSectionsYaml":{"edges":[{"node":{"id":"e2fe587f-aa0f-5bc4-9837-9f8aab4ac959","Title":"Who are we?","Content":"<p>FOSS@Amrita (also known as amFOSS ) is a community of passionate college students,\nwho have come together for the cause of promoting and contributing to Free and Open\nSource Software, whilst achieving excellence in the field of technology in their pursuit of knowledge.</p>\n<p>The club envisions to make its members competent to become the leaders of the future with\nexcellence in technical, creative, and intrapersonal skills, through making them learn how to learn,\nby simulating a workspace like atmosphere inside the lab, and making them go through all challenges,\nand setbacks they may face in the real world.</p>\n<p>Founded in 2008, the club over the years has been renowned as one of the leading student clubs in India,\nwith about 500 active members. It has so far produced 30+ GSoCers, and established Amrita Vishwa Vidyapeetham,\nAmritapuri Campus as globally 8th ranked in GSoC ranking. The club is run by the students themselves, with the\nhelp of research scholars, alumni, and faculties.</p>\n","childrenHomeSectionsPointsYaml":[],"childrenHomeSectionsStatsYaml":[],"childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/30cf3dd07f8fc976dd1aba4575514f7c/b17c1/who_are_we.jpg"}}}}},{"node":{"id":"77b60708-2f58-57a0-9501-89fa144092ff","Title":"What we do?","Content":"<p>The club operates by the principle of mentorship and family, where the senior members of the club individually\nmentor the juniors, and the club as such acting as a family where the one helps the other out.</p>\n<p>The members contribute to Open Source projects of various popular open source organizations, work on developing\ntheir own projects including the club projects aimed at solving real world problems, participate in GSoC, developer\nmeets, hackathons etc. The members also conduct workshops and technical fests to encourage others to work on open\nsource technologies.</p>\n<p>The club also got specialised teams internally such as one focused on Android, Blockchain, IoT, Data Science,\nMachine Learning, Problem-solving, UI/UX, and Web Development.</p>\n<p>The club believes in the holistic development of its members, and the members besides seeking excellence in\ntechnical skills, also engage in talks, debates, sports, cultural activities, yoga sessions etc.</p>\n","childrenHomeSectionsPointsYaml":[{"id":"3bdff4f9-8828-5927-9a9b-c3abe0ce3c60","Text":["Mentor & train students","to take on the world"],"Icon":{"publicURL":"/static/mentor-cc12b2f355d5827105f33c17cec081ae.svg"}},{"id":"fc439dff-5fe1-5b8b-82ee-852c3544e1c3","Text":["Promote Open Source","and Computer Science"],"Icon":{"publicURL":"/static/talk-f2d106def66ed02da272e0f614e69d33.svg"}},{"id":"eeb12fa3-e360-5697-926d-83425181b2a9","Text":["Contribute to Open Source","Projects & Communities"],"Icon":{"publicURL":"/static/code-4289438f7548b4edfd4c01529adc0adc.svg"}}],"childrenHomeSectionsStatsYaml":[],"childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/2d4206dfed41bd7e064c8665413429cb/fd8a5/what_we_do.png"}}}}},{"node":{"id":"0a80e69f-8fd0-5365-9c6d-cee914b2b8aa","Title":"What we have achieved?","Content":"<p>The club has become one of the forerunners in promoting, and contributing to open\nsource in the country, introducing over a hundred enthusiasts every year to the world\nof Open source through the various activities it conducts.</p>\n<p>The club has produced 50+ GSoCers over the last 10 years, with about 15 developers getting selected every year.\nThe members have been actively taking part in international conferences, meetups, hackathons, as well as delivering\ntalks and presenting projects at various events.</p>\n<p>Majority of the club alumni have been placed in core computer science companies such as Google, Microsoft, Intel,\nIBM and VMWare. The active members also get selected for summer schools at global universities, and paid\ninternships at top companies. Some of our alumni are currently Phd. research scholars at various foreign\nuniversities.</p>\n","childrenHomeSectionsPointsYaml":[],"childrenHomeSectionsStatsYaml":[{"Text":"Students Trained","Num":"500+"},{"Text":"GSoC Students","Num":"50+"},{"Text":"Alumni in Core CS Jobs","Num":"100+"},{"Text":"Working in Startups","Num":"50+"}],"childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/0ac9c0b295b265bd47a4724a9d89cdcc/a54c6/what_did_we_achieve.png"}}}}}]}}}