{"data":{"allStoryYaml":{"nodes":[{"id":"727cee8f-04d7-582f-9e76-8dd05a6e5fec","Title":"The Spark","Content":"<p>The club’s story starts when its founder, Mr. Vipin Pavithran, joined Amrita University in 2006 after ten years of experience with the software industry in the US.\nThe readiness to guide and mentor was the spark. His willingness to help and bring out the best in each student who he mentored, provided the fundamentals of what the club is established on. He believes that each student has great potential which is to be brought out, which is now delivered through the club activities.</p>\n","Quote":"“I know the value of right guidance at the right time and how it can make a huge impact. This made me want to help any one who needed guidance.”","childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/46c03e23fa4da62b255b5b3918849ff6/b17c1/vipin_sir.jpg"}}}},{"id":"49902564-10fe-50c4-a857-2f43c716529a","Title":"A Humble Beginning","Content":"<p>In the summer of 2006, he was approached by Abhilash T G, seeking a mentor to participate in the IBM Great Mind Challenge 2006. Soon a team of enthusiasts was formed and rigorous preparation had been initiated. Initially the students were not confident of getting selected, let alone winning; however they were highly motivated and enthusiastic about it. At the same time, Vipin sir was confident in his students as he was certain that his students would come on top.</p>\n<p>Months passed, with the team working day and night under intense preparation focusing only on their goal. They missed out on their usual college life, and were often mocked by their classmates. Infact, there were instances when nothing went their way and they thought of giving up, but they were motivated and pushed forward by Vipin sir.</p>\n<p>In the end, they ended up among the Top 5 teams from India, and were invited to Mumbai for the prize distribution ceremony. This was the first national level prize to be won by Amritapuri students.</p>\n","Quote":null,"childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/ae2dfde0a5f0155be33b1b61a7a19cb8/a54c6/ibm-great-mind.png"}}}},{"id":"5cd95e34-4248-51c3-a582-84acdbe3158a","Title":"Winning the Sun Code for Freedom","Content":"<p>Motivated by the success, Vipin sir started searching for more contests at the national and international level.\nHe then came across the Sun Code For Freedom 2008, conducted by Sun Microsystems, which was about contributing to their open source projects. It had already been 2 months since the contest started and Avinash Joshi, a third-year student was put on to work on contributing to Open Solaris, the open sourced version of Solaris operating system from Sun Microsystems. Avinash who had just completed his course on Operating System was now expected to contribute to one with over 9 million lines of code.\nAfter two months of intense effort Avinash finally figured out how to contribute and started contributing to it. He documented the entire process so that his peers could also get started with it and soon enough many students started contributing to it.</p>\n<p>Every day, students would stayback in the lab till late and work on contributing to various open source software from Sun Microsystems. When the contest was judged, Amrita Vishwa Vidyapeetham emerged as the champion university, with a total of 105 contributions. The team that came second had only 10 contributions in total. Our students were invited to Hyderabad for the Sun Tech Days 2008 where the prizes were awarded. After this students started regularly contributing to Sun Open Source products with the active support of Sun Microsystems.</p>\n","Quote":null,"childFileYaml":{"childImageSharp":{"fluid":{"src":"/static/ea4be4b1d7290093f57b00774089d678/78d2a/sun-code-for-freedom.png"}}}},{"id":"cbac54a0-def6-501d-96f0-018100a7260c","Title":"Gaining Recognition through GSoC","Content":"<p>In 2010, Vipin sir chanced upon Google Summer of Code, and 3 members of the club got selected for the first time. Over the years, through the experiences shared by the seniors, more and more students started participating in GSoC. Having started with a strength of 10 members, the club now has about 50 active members, and several alumni actively mentoring the club.</p>\n","Quote":null,"childFileYaml":null}]}}}